tanakamasayuki/ESP32SerialCtl/src/ESP32SerialCtl.h
    static char *ltrim(char *text)
    {
      while (*text && isspace(static_cast<unsigned char>(*text)))
      {
        ++text;
      }
      return text;
    }

    static void rtrim(char *text)
    {
      size_t len = strlen(text);
      while (len > 0)
      {
        unsigned char ch = static_cast<unsigned char>(text[len - 1]);
        if (!isspace(ch))
        {
          break;
        }
        text[--len] = '\0';
      }
    }

    static void stripComment(char *text)
    {
      bool inQuote = false;
      bool escape = false;
      for (char *cursor = text; *cursor; ++cursor)
      {
        const char ch = *cursor;
        if (inQuote)
        {
          if (escape)
          {
            escape = false;
          }
          else if (ch == '\\')
          {
            escape = true;
          }
          else if (ch == '"')
          {
            inQuote = false;
          }
          continue;
        }
        if (ch == '"')
        {
          inQuote = true;
        }
        else if (ch == '#')
        {
          *cursor = '\0';
          break;
        }
      }
    }

    static char translateEscape(char ch)
    {
      switch (ch)
      {
      case 'n':
        return '\n';
      case 'r':
        return '\r';
      case 't':
        return '\t';
      case '"':
        return '"';
      case '\\':
        return '\\';
      default:
        return ch;
      }
    }

    void emitOK(const char *message)
    {
      output_.print("OK");
      if (message && *message)
      {
        output_.print(' ');
        output_.print(message);
      }
      output_.print("\r\n");
      queuePrompt();
    }

    void emitError(uint16_t code, const char *reason)
    {
      output_.print("ERR ");
      output_.print(code);
      output_.print(' ');
      if (reason && *reason)
      {
        output_.print(reason);
      }
      output_.print("\r\n");
      queuePrompt();
    }

    void emitList(const char *text)
    {
      output_.print(" - ");
      if (text)
      {
        output_.print(text);
      }
      output_.print("\r\n");
    }

    void emitBody(const char *text)
    {
      output_.print("| ");
      if (text)
      {
        output_.print(text);
      }
      output_.print("\r\n");
    }

    void flushPromptIfNeeded()
    {
      if (!promptPending_)
      {
        return;
      }
      promptPending_ = false;
      output_.print("> ");
    }

    void queuePrompt() { promptPending_ = true; }

    Stream &input_;
    Print &output_;
    const Command *const commands_;
    const size_t commandCount_;
    char lineBuffer_[MaxLineLength + 1];
    size_t linePos_ = 0;
    bool overflow_ = false;

    Context context_;
    Argument arguments_[MaxTokens];
    Option options_[MaxTokens];
    size_t optionCount_ = 0;
    bool promptPending_ = true;
  };

  template <size_t MaxLineLength = 128, size_t MaxTokens = 16>
  class ESP32SerialCtl
  {
  public:
    using Base = SerialCtl<MaxLineLength, MaxTokens>;
    using Command = typename Base::Command;
    using Context = typename Base::Context;

    ESP32SerialCtl()
        : cli_(Serial, kCommands, kCommandCount) {}

    explicit ESP32SerialCtl(Stream &io)
        : cli_(io, kCommands, kCommandCount) {}

    ESP32SerialCtl(Stream &input, Print &output)
        : cli_(input, output, kCommands, kCommandCount) {}

    Base &raw() { return cli_; }
    const Base &raw() const { return cli_; }

    void service() { cli_.service(); }
    void feed(char c) { cli_.feed(c); }
    void execute(const char *line) { cli_.execute(line); }

    Print &output() { return cli_.output(); }
    Stream &input() { return cli_.input(); }

    static void setDefaultRgbPin(int pin) { rgbDefaultPin_ = pin; }
    static int defaultRgbPin() { return rgbDefaultPin_; }

  private:
    static bool parsePinArgument(Context &ctx, const typename Base::Argument &arg,
                                 uint8_t &pin, const char *field)
    {
      ParsedNumber number;
      if (!arg.toNumber(number) || number.unit != NumberUnit::None || number.value < 0 ||
          number.value > 255)
      {
        ctx.printError(400, field);
        return false;
      }
      pin = static_cast<uint8_t>(number.value);
      return true;
    }

    static bool parseUint8Component(Context &ctx, const typename Base::Argument &arg,
                                    uint8_t &value, const char *field)
    {
      ParsedNumber number;
      if (!arg.toNumber(number) || number.unit != NumberUnit::None ||
          number.value < 0 || number.value > 255)
      {
        ctx.printError(400, field);
        return false;
      }
      value = static_cast<uint8_t>(number.value);
      return true;
    }

    static bool parseBooleanToken(const typename Base::Argument &arg, bool &value)
    {
      if (arg.equals("on") || arg.equals("high") || arg.equals("1") || arg.equals("true"))
      {
        value = true;
        return true;
      }
      if (arg.equals("off") || arg.equals("low") || arg.equals("0") || arg.equals("false"))
      {
        value = false;
        return true;
      }
      return false;
    }

    static bool parseFrequencyArgument(Context &ctx, const typename Base::Argument &arg,
                                       uint32_t &freqHz)
    {
      ParsedNumber number;
      if (!arg.toNumber(number) || number.value <= 0)
      {
        ctx.printError(400, "Invalid frequency");
        return false;
      }
      if (number.unit != NumberUnit::None && number.unit != NumberUnit::FrequencyHz)
      {
        ctx.printError(400, "Invalid frequency unit");
        return false;
      }
      freqHz = static_cast<uint32_t>(number.value);
      return true;
    }

    static bool parseDutyArgument(Context &ctx, const typename Base::Argument &arg,
                                  uint8_t bits, uint32_t &dutyValue)
    {
      ParsedNumber number;
      if (!arg.toNumber(number))
      {
        ctx.printError(400, "Invalid duty");
        return false;
      }
      const uint32_t dutyMax = (1u << bits);
      int64_t value = number.value;
      if (number.unit == NumberUnit::Percent)
      {
        if (value < 0)
        {
          value = 0;
        }
        if (value > 100)
        {
          value = 100;
        }
        dutyValue = static_cast<uint32_t>((static_cast<uint64_t>(dutyMax) * value + 50) / 100);
        return true;
      }
      if (number.unit != NumberUnit::None)
      {
        ctx.printError(400, "Invalid duty unit");
        return false;
      }
      if (value < 0)
      {
        ctx.printError(400, "Duty out of range");
        return false;
      }
      const uint32_t rawMax = (1u << bits);
      if (value > static_cast<int64_t>(rawMax))
      {
        ctx.printError(400, "Duty out of range");
        return false;
      }
      if (value == static_cast<int64_t>(rawMax))
      {
        dutyValue = dutyMax;
        return true;
      }
      dutyValue = static_cast<uint32_t>(value);
      return true;
    }

