tanakamasayuki/ESP32SerialCtl/src/ESP32SerialCtl.h
    static uint32_t parseCountOption(Context &ctx, const char *name, uint32_t defaultValue)
    {
      const typename Base::Option *opt = ctx.findOption(name);
      if (!opt)
      {
        return defaultValue;
      }
      ParsedNumber number;
      if (!opt->toNumber(number) || number.unit != NumberUnit::None || number.value <= 0)
      {
        ctx.printError(400, "Invalid option");
        return 0;
      }
      return static_cast<uint32_t>(number.value);
    }

    static int resolveRgbPin(Context &ctx)
    {
      const typename Base::Option *pinOpt = ctx.findOption("pin");
      if (pinOpt && pinOpt->value)
      {
        ParsedNumber number;
        if (!Base::parseNumber(pinOpt->value, number) ||
            number.unit != NumberUnit::None || number.value < 0 || number.value > 255)
        {
          ctx.printError(400, "Invalid pin");
          return -1;
        }
        return static_cast<int>(number.value);
      }
      if (rgbDefaultPin_ < 0)
      {
        ctx.printError(404, "RGB pin not set");
        return -1;
      }
      return rgbDefaultPin_;
    }

    static bool resolveWaitOption(Context &ctx, uint32_t defaultWait, uint32_t &out)
    {
      const typename Base::Option *waitOpt = ctx.findOption("wait");
      if (!waitOpt)
      {
        out = defaultWait;
        return true;
      }
      ParsedNumber number;
      if (!Base::parseNumber(waitOpt->value, number) ||
          (number.unit != NumberUnit::None && number.unit != NumberUnit::TimeMilliseconds))
      {
        ctx.printError(400, "Invalid wait");
        return false;
      }
      int64_t value = number.value;
      if (number.unit == NumberUnit::TimeMilliseconds)
      {
        value *= 1000;
      }
      if (value < 0)
      {
        value = 0;
      }
      out = static_cast<uint32_t>(value);
      return true;
    }

    static bool isGpioOutputEnabled(uint8_t pin)
    {
#if defined(SOC_GPIO_PIN_COUNT)
      if (pin >= SOC_GPIO_PIN_COUNT)
      {
        return false;
      }
#endif

      if (pin < 32)
      {
#if defined(GPIO_ENABLE_REG)
        uint32_t enable = REG_READ(GPIO_ENABLE_REG);
        return ((enable >> pin) & 0x1u) != 0;
#else
        return false;
#endif
      }

#if defined(GPIO_ENABLE1_REG)
      if (pin < 64)
      {
        uint32_t enable = REG_READ(GPIO_ENABLE1_REG);
        return ((enable >> (pin - 32)) & 0x1u) != 0;
      }
#endif

#if defined(GPIO_ENABLE2_REG)
      if (pin < 96)
      {
        uint32_t enable = REG_READ(GPIO_ENABLE2_REG);
        return ((enable >> (pin - 64)) & 0x1u) != 0;
      }
#endif

#if defined(GPIO_ENABLE3_REG)
      if (pin < 128)
      {
        uint32_t enable = REG_READ(GPIO_ENABLE3_REG);
        return ((enable >> (pin - 96)) & 0x1u) != 0;
      }
#endif

      return false;
    }

#if defined(ESP32SERIALCTL_HAS_WIRE)
    struct I2cBusEntry
    {
      TwoWire *wire;
      const char *name;
      uint8_t index;
    };

    static const I2cBusEntry *availableI2cBuses(size_t &count)
    {
      static const I2cBusEntry entries[] = {
          {&Wire, "Wire", 0},
#if defined(ESP32SERIALCTL_HAS_WIRE1)
          {&Wire1, "Wire1", 1},
#endif
#if defined(ESP32SERIALCTL_HAS_WIRE2)
          {&Wire2, "Wire2", 2},
#endif
      };
      count = sizeof(entries) / sizeof(entries[0]);
      count = count > 0 ? count : 0;
      return entries;
    }

    static const I2cBusEntry *resolveI2cBus(Context &ctx)
    {
      size_t busCount = 0;
      const I2cBusEntry *buses = availableI2cBuses(busCount);
      if (busCount == 0 || !buses)
      {
        ctx.printError(500, "I2C unavailable");
        return nullptr;
      }

      const typename Base::Option *busOpt = ctx.findOption("bus");
      if (!busOpt || !busOpt->value || !*busOpt->value)
      {
        return &buses[0];
      }

      const char *value = busOpt->value;
      for (size_t i = 0; i < busCount; ++i)
      {
        if (Base::equalsIgnoreCase(value, buses[i].name))
        {
          return &buses[i];
        }
        char alias[8];
        if (buses[i].index == 0)
        {
          if (Base::equalsIgnoreCase(value, "wire0") ||
              Base::equalsIgnoreCase(value, "default") ||
              Base::equalsIgnoreCase(value, "0"))
          {
            return &buses[i];
          }
        }
        else
        {
          snprintf(alias, sizeof(alias), "wire%u",
                   static_cast<unsigned int>(buses[i].index));
          if (Base::equalsIgnoreCase(value, alias))
          {
            return &buses[i];
          }
        }
      }

      ParsedNumber number;
      if (Base::parseNumber(value, number) &&
          number.unit == NumberUnit::None)
      {
        for (size_t i = 0; i < busCount; ++i)
        {
          if (number.value == static_cast<int64_t>(buses[i].index))
          {
            return &buses[i];
          }
        }
      }

      ctx.printError(404, "Unknown bus");
      return nullptr;
    }

    static bool parseI2cAddress(Context &ctx, const typename Base::Argument &arg, uint8_t &address)
    {
      ParsedNumber number;
      if (!arg.toNumber(number) || number.unit != NumberUnit::None ||
          number.value < 0 || number.value > 0x7F)
      {
        ctx.printError(400, "Invalid address");
        return false;
      }
      address = static_cast<uint8_t>(number.value);
      return true;
    }

    static bool parseI2cRegister(Context &ctx, const typename Base::Argument &arg, uint8_t &reg)
    {
      return parseUint8Component(ctx, arg, reg, "Invalid register");
    }

    static bool parseI2cLength(Context &ctx, const typename Base::Argument &arg, size_t &length)
    {
      ParsedNumber number;
      if (!arg.toNumber(number) || number.unit != NumberUnit::None ||
          number.value <= 0 || number.value > 32)
      {
        ctx.printError(400, "Invalid length");
        return false;
      }
      length = static_cast<size_t>(number.value);
      return true;
    }

    static void printI2cTransmissionError(Context &ctx, uint8_t code, const char *stage)
    {
      const char *reason = "unknown error";
      switch (code)
      {
      case 1:
        reason = "data too long";
        break;
      case 2:
        reason = "nack on address";
        break;
      case 3:
        reason = "nack on data";
        break;
      case 4:
        reason = "bus error";
        break;
      case 5:
        reason = "timeout";
        break;
      default:
        break;
      }
      char line[80];
      if (stage && *stage)
      {
        snprintf(line, sizeof(line), "%s failed: %s (%u)", stage, reason, static_cast<unsigned int>(code));
      }
      else
      {
        snprintf(line, sizeof(line), "I2C error: %s (%u)", reason, static_cast<unsigned int>(code));
      }
      ctx.printError(502, line);
    }

    static void handleI2cScan(Context &ctx)
    {
      size_t busCount = 0;
      const I2cBusEntry *buses = availableI2cBuses(busCount);
      if (busCount == 0)
      {
        ctx.printError(500, "I2C unavailable");
        return;
      }

      ctx.printOK("i2c scan");
      auto scanBus = [&](const I2cBusEntry &bus)
      {
        char line[48];
        snprintf(line, sizeof(line), "bus: %s (%u)", bus.name,
                 static_cast<unsigned int>(bus.index));
        ctx.printBody(line);

