tanakamasayuki/ESP32SerialCtl/src/ESP32SerialCtl.h
        bool any = false;
        for (uint8_t addr = 0x03; addr <= 0x77; ++addr)
        {
          bus.wire->beginTransmission(addr);
          uint8_t error = bus.wire->endTransmission();
          if (error == 0)
          {
            snprintf(line, sizeof(line), "addr: 0x%02X",
                     static_cast<unsigned int>(addr));
            ctx.printList(line);
            any = true;
          }
        }

        if (!any)
        {
          ctx.printBody("no devices");
        }
      };

      const typename Base::Option *busOpt = ctx.findOption("bus");
      if (busOpt && busOpt->value && *busOpt->value)
      {
        const I2cBusEntry *selected = resolveI2cBus(ctx);
        if (!selected)
        {
          return;
        }
        scanBus(*selected);
        return;
      }

      for (size_t i = 0; i < busCount; ++i)
      {
        scanBus(buses[i]);
      }
    }

    static void handleI2cRead(Context &ctx)
    {
      if (ctx.argc() < 2 || ctx.argc() > 3)
      {
        ctx.printError(400, "Usage: i2c read [--bus name|index] <addr> <reg> [len]");
        return;
      }

      const I2cBusEntry *bus = resolveI2cBus(ctx);
      if (!bus)
      {
        return;
      }
      TwoWire &i2c = *bus->wire;

      uint8_t address;
      if (!parseI2cAddress(ctx, ctx.arg(0), address))
      {
        return;
      }

      uint8_t reg;
      if (!parseI2cRegister(ctx, ctx.arg(1), reg))
      {
        return;
      }

      size_t length = 1;
      if (ctx.argc() == 3 && !parseI2cLength(ctx, ctx.arg(2), length))
      {
        return;
      }

      i2c.beginTransmission(address);
      i2c.write(reg);
      uint8_t error = i2c.endTransmission(false);
      if (error != 0)
      {
        char stage[48];
        snprintf(stage, sizeof(stage), "register write (bus %s)", bus->name);
        printI2cTransmissionError(ctx, error, stage);
        return;
      }

      size_t received =
          i2c.requestFrom(static_cast<uint8_t>(address),
                          static_cast<uint8_t>(length), true);
      if (received != length)
      {
        ctx.printError(504, "Incomplete read");
        while (i2c.available() > 0)
        {
          i2c.read();
        }
        return;
      }

      uint8_t buffer[32];
      for (size_t i = 0; i < length; ++i)
      {
        int value = i2c.read();
        if (value < 0)
        {
          ctx.printError(504, "Read failed");
          return;
        }
        buffer[i] = static_cast<uint8_t>(value);
      }

      char dataLine[3 * 32 + 1];
      size_t pos = 0;
      const char *hex = "0123456789ABCDEF";
      for (size_t i = 0; i < length && pos + 2 < sizeof(dataLine); ++i)
      {
        if (i > 0 && pos < sizeof(dataLine) - 1)
        {
          dataLine[pos++] = ' ';
        }
        if (pos + 2 >= sizeof(dataLine))
        {
          break;
        }
        dataLine[pos++] = hex[buffer[i] >> 4];
        dataLine[pos++] = hex[buffer[i] & 0x0F];
      }
      dataLine[pos] = '\0';

      ctx.printOK("i2c read");
      char line[128];
      snprintf(line, sizeof(line), "bus: %s (%u)", bus->name,
               static_cast<unsigned int>(bus->index));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "addr: 0x%02X", static_cast<unsigned int>(address));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "reg: 0x%02X", static_cast<unsigned int>(reg));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "len: %u", static_cast<unsigned int>(length));
      ctx.printBody(line);
      if (length > 0)
      {
        snprintf(line, sizeof(line), "data: %s", dataLine);
        ctx.printBody(line);
      }
    }

    static void handleI2cWrite(Context &ctx)
    {
      if (ctx.argc() < 3)
      {
        ctx.printError(400, "Usage: i2c write [--bus name|index] <addr> <reg> <bytes...>");
        return;
      }

      const I2cBusEntry *bus = resolveI2cBus(ctx);
      if (!bus)
      {
        return;
      }
      TwoWire &i2c = *bus->wire;

      uint8_t address;
      if (!parseI2cAddress(ctx, ctx.arg(0), address))
      {
        return;
      }

      uint8_t reg;
      if (!parseI2cRegister(ctx, ctx.arg(1), reg))
      {
        return;
      }

      const size_t dataCount = ctx.argc() - 2;
      if (dataCount > 32)
      {
        ctx.printError(413, "Too many bytes");
        return;
      }
      uint8_t data[32];
      for (size_t i = 0; i < dataCount; ++i)
      {
        if (!parseUint8Component(ctx, ctx.arg(i + 2), data[i], "Invalid data byte"))
        {
          return;
        }
      }

      i2c.beginTransmission(address);
      i2c.write(reg);
      for (size_t i = 0; i < dataCount; ++i)
      {
        i2c.write(data[i]);
      }
      uint8_t error = i2c.endTransmission(true);
      if (error != 0)
      {
        char stage[40];
        snprintf(stage, sizeof(stage), "write (bus %s)", bus->name);
        printI2cTransmissionError(ctx, error, stage);
        return;
      }

      char bytesLine[3 * 32 + 1];
      size_t pos = 0;
      const char *hex = "0123456789ABCDEF";
      for (size_t i = 0; i < dataCount && pos + 2 < sizeof(bytesLine); ++i)
      {
        if (i > 0 && pos < sizeof(bytesLine) - 1)
        {
          bytesLine[pos++] = ' ';
        }
        if (pos + 2 >= sizeof(bytesLine))
        {
          break;
        }
        bytesLine[pos++] = hex[data[i] >> 4];
        bytesLine[pos++] = hex[data[i] & 0x0F];
      }
      bytesLine[pos] = '\0';

      ctx.printOK("i2c write");
      char line[128];
      snprintf(line, sizeof(line), "bus: %s (%u)", bus->name,
               static_cast<unsigned int>(bus->index));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "addr: 0x%02X", static_cast<unsigned int>(address));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "reg: 0x%02X", static_cast<unsigned int>(reg));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "bytes: %s", bytesLine);
      ctx.printBody(line);
    }
#endif

    static constexpr uint8_t kPwmResolutionBits = 8;

