tanakamasayuki/ESP32SerialCtl/src/ESP32SerialCtl.h
      const size_t heapLargest = heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT);
      addLine("Heap Largest Block: %lu bytes", static_cast<unsigned long>(heapLargest));

      const size_t internalTotal = heap_caps_get_total_size(MALLOC_CAP_INTERNAL);
      if (internalTotal > 0U)
      {
        addLine("Internal Total: %lu bytes", static_cast<unsigned long>(internalTotal));

        const size_t internalFree = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
        addLine("Internal Free: %lu bytes", static_cast<unsigned long>(internalFree));

        const size_t internalMin = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL);
        addLine("Internal Min Free: %lu bytes", static_cast<unsigned long>(internalMin));

        const size_t internalLargest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL);
        addLine("Internal Largest Block: %lu bytes",
                static_cast<unsigned long>(internalLargest));
      }

      const size_t psramTotal = heap_caps_get_total_size(MALLOC_CAP_SPIRAM);
      if (psramTotal > 0U)
      {
        addLine("PSRAM Total: %lu bytes", static_cast<unsigned long>(psramTotal));

        const size_t psramFree = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
        addLine("PSRAM Free: %lu bytes", static_cast<unsigned long>(psramFree));

        const size_t psramMin = heap_caps_get_minimum_free_size(MALLOC_CAP_SPIRAM);
        addLine("PSRAM Min Free: %lu bytes", static_cast<unsigned long>(psramMin));

        const size_t psramLargest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
        addLine("PSRAM Largest Block: %lu bytes",
                static_cast<unsigned long>(psramLargest));
      }

      const size_t rtosHeapFree = static_cast<size_t>(xPortGetFreeHeapSize());
      addLine("RTOS Heap Free: %lu bytes", static_cast<unsigned long>(rtosHeapFree));

      const size_t rtosHeapMin = static_cast<size_t>(xPortGetMinimumEverFreeHeapSize());
      addLine("RTOS Heap Min Free: %lu bytes", static_cast<unsigned long>(rtosHeapMin));

      const UBaseType_t stackHighWater = uxTaskGetStackHighWaterMark(nullptr);
      addLine("Task Stack High Water: %lu words", static_cast<unsigned long>(stackHighWater));

      ctx.printOK("sys mem");
      for (size_t i = 0; i < lineCount; ++i)
      {
        ctx.printBody(lines[i]);
      }
    }

    static void handleSysReset(Context &ctx)
    {
      ctx.printOK("sys reset");
      ctx.printBody("Restarting...");
      ctx.controller().output().flush();
      delay(50);

      if (rgbDefaultPin_ >= 0)
      {
        rgbLedWrite(rgbDefaultPin_, 0, 0, 0);
      }
      for (int i = 0; i < GPIO_PIN_COUNT; i++)
      {
        pinMode(i, INPUT);
      }

      ESP.restart();
    }

    static void handleHelp(Context &ctx)
    {
      if (ctx.argc() > 1)
      {
        ctx.printError(400, "Usage: help [topic]");
        return;
      }

      if (!ctx.arg(0).empty())
      {
        if (!ctx.controller().printHelp(ctx.arg(0).c_str()))
        {
          ctx.printError(404, "Unknown help topic");
        }
        return;
      }

      ctx.controller().printHelp();
    }

    static void handleGpioMode(Context &ctx)
    {
      if (ctx.argc() < 2)
      {
        ctx.printError(400, "Usage: gpio mode <pin> <mode>");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      const typename Base::Argument &modeArg = ctx.arg(1);
      int mode = -1;
      const char *modeName = nullptr;
      if (modeArg.equals("in"))
      {
        mode = INPUT;
        modeName = "in";
      }
      else if (modeArg.equals("out"))
      {
        mode = OUTPUT;
        modeName = "out";
      }
      else if (modeArg.equals("pullup"))
      {
        mode = INPUT_PULLUP;
        modeName = "pullup";
      }
      else if (modeArg.equals("pulldown"))
      {
#ifdef INPUT_PULLDOWN
        mode = INPUT_PULLDOWN;
        modeName = "pulldown";
#else
        ctx.printError(501, "pulldown unsupported");
        return;
#endif
      }
      else if (modeArg.equals("opendrain"))
      {
#ifdef OUTPUT_OPEN_DRAIN
        mode = OUTPUT_OPEN_DRAIN;
        modeName = "opendrain";
#else
        ctx.printError(501, "opendrain unsupported");
        return;
#endif
      }

      if (mode < 0)
      {
        ctx.printError(400, "Invalid mode");
        return;
      }

      pinMode(pin, mode);
      ctx.printOK("gpio mode");
      char line[48];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "mode: %s", modeName);
      ctx.printBody(line);
    }

    static void handleGpioRead(Context &ctx)
    {
      if (ctx.argc() < 1)
      {
        ctx.printError(400, "Usage: gpio read <pin>");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      int value = digitalRead(pin);
      ctx.printOK("gpio read");
      char line[48];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "value: %d", value);
      ctx.printBody(line);
    }

    static void handleGpioWrite(Context &ctx)
    {
      if (ctx.argc() < 2)
      {
        ctx.printError(400, "Usage: gpio write <pin> <value>");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      bool state;
      if (!parseBooleanToken(ctx.arg(1), state))
      {
        ctx.printError(400, "Invalid value");
        return;
      }

      if (!isGpioOutputEnabled(pin))
      {
        pinMode(pin, OUTPUT);
        if (!isGpioOutputEnabled(pin))
        {
          ctx.printError(501, "Output unsupported");
          return;
        }
      }

      digitalWrite(pin, state ? HIGH : LOW);
      ctx.printOK("gpio write");
      char line[48];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "value: %s", state ? "high" : "low");
      ctx.printBody(line);
    }

