tanakamasayuki/ESP32SerialCtl/src/ESP32SerialCtl.h
    static void handleGpioToggle(Context &ctx)
    {
      if (ctx.argc() < 1)
      {
        ctx.printError(400, "Usage: gpio toggle <pin>");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      int current = digitalRead(pin);
      int next = current ? LOW : HIGH;
      digitalWrite(pin, next);
      ctx.printOK("gpio toggle");
      char line[48];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "value: %s", next ? "high" : "low");
      ctx.printBody(line);
    }

    static void handleAdcRead(Context &ctx)
    {
      if (ctx.argc() < 1)
      {
        ctx.printError(400, "Usage: adc read <pin> [samples N]");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      uint32_t samples = 1;
      if (ctx.argc() >= 3 && ctx.arg(1).equals("samples"))
      {
        ParsedNumber number;
        if (!ctx.arg(2).toNumber(number) || number.unit != NumberUnit::None || number.value <= 0)
        {
          ctx.printError(400, "Invalid samples");
          return;
        }
        samples = static_cast<uint32_t>(number.value);
      }
      else if (ctx.argc() == 2 && !ctx.arg(1).equals("samples"))
      {
        ParsedNumber number;
        if (!ctx.arg(1).toNumber(number) || number.unit != NumberUnit::None || number.value <= 0)
        {
          ctx.printError(400, "Invalid samples");
          return;
        }
        samples = static_cast<uint32_t>(number.value);
      }

      uint64_t total = 0;
      for (uint32_t i = 0; i < samples; ++i)
      {
        total += static_cast<uint32_t>(analogRead(pin));
      }
      uint32_t average = static_cast<uint32_t>(total / samples);
      ctx.printOK("adc read");
      char line[64];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "samples: %lu", static_cast<unsigned long>(samples));
      ctx.printBody(line);
      snprintf(line, sizeof(line), "value: %lu", static_cast<unsigned long>(average));
      ctx.printBody(line);
    }

    static void handlePwmSet(Context &ctx)
    {
      if (ctx.argc() < 3)
      {
        ctx.printError(400, "Usage: pwm set <pin> <freq> <duty> ");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      uint32_t freqHz;
      if (!parseFrequencyArgument(ctx, ctx.arg(1), freqHz))
      {
        return;
      }
      const uint8_t bits = kPwmResolutionBits;
      if (ctx.argc() >= 4)
      {
        ctx.printError(400, "Usage: pwm set <pin> <freq> <duty>");
        return;
      }
      uint32_t dutyValue = 0;
      if (!parseDutyArgument(ctx, ctx.arg(2), bits, dutyValue))
      {
        return;
      }

      ledcAttach(pin, freqHz, bits);
      if (!ledcWrite(pin, dutyValue))
      {
        ctx.printError(500, "pwm write failed");
        return;
      }

      ctx.printOK("pwm set");
      char line[64];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "freq: %lu Hz", freqHz);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "bits: %u", kPwmResolutionBits);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "duty: %lu / %lu",
               static_cast<unsigned long>(dutyValue),
               static_cast<unsigned long>(1u << bits));
      ctx.printBody(line);
    }

    static void handlePwmStop(Context &ctx)
    {
      if (ctx.argc() < 1)
      {
        ctx.printError(400, "Usage: pwm stop <pin>");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }

      if (ledcReadFreq(pin) != 0)
      {
        ledcDetach(pin);
      }
      ctx.printOK("pwm stop");
      char line[48];
      snprintf(line, sizeof(line), "pin: %u", pin);
      ctx.printBody(line);
    }

    static void handleRgbPin(Context &ctx)
    {
      if (ctx.argc() < 1)
      {
        ctx.printError(400, "Usage: rgb pin <pin>");
        return;
      }
      uint8_t pin;
      if (!parsePinArgument(ctx, ctx.arg(0), pin, "Invalid pin"))
      {
        return;
      }
      rgbDefaultPin_ = pin;
      ctx.printOK("rgb pin");
      char line[48];
      snprintf(line, sizeof(line), "default: %u", pin);
      ctx.printBody(line);
    }

    static void rgbWriteRepeated(int pin, uint8_t r, uint8_t g, uint8_t b,
                                 uint32_t count, uint32_t waitUs)
    {
      for (uint32_t i = 0; i < count; ++i)
      {
        rgbLedWrite(pin, r, g, b);
        if (waitUs > 0 && i + 1 < count)
        {
          delayMicroseconds(waitUs);
        }
      }
    }

    static void handleRgbSet(Context &ctx)
    {
      if (ctx.argc() < 3)
      {
        ctx.printError(400, "Usage: rgb set [--pin pin] [--count N] [--wait us] <r> <g> <b>");
        return;
      }
      int pin = resolveRgbPin(ctx);
      if (pin < 0)
      {
        return;
      }

      uint8_t r, g, b;
      if (!parseUint8Component(ctx, ctx.arg(0), r, "Invalid red") ||
          !parseUint8Component(ctx, ctx.arg(1), g, "Invalid green") ||
          !parseUint8Component(ctx, ctx.arg(2), b, "Invalid blue"))
      {
        return;
      }

      uint32_t count = parseCountOption(ctx, "count", 1);
      if (count == 0)
      {
        return;
      }
      uint32_t waitUs = 0;
      if (!resolveWaitOption(ctx, 100, waitUs))
      {
        return;
      }

      rgbWriteRepeated(pin, r, g, b, count, waitUs);

      ctx.printOK("rgb set");
      char line[64];
      snprintf(line, sizeof(line), "pin: %d", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "rgb: %u %u %u", r, g, b);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "count: %lu wait: %lu us",
               static_cast<unsigned long>(count),
               static_cast<unsigned long>(waitUs));
      ctx.printBody(line);
    }

    static void handleRgbStream(Context &ctx)
    {
      if (ctx.argc() < 3 || (ctx.argc() % 3) != 0)
      {
        ctx.printError(400, "Usage: rgb stream [--pin pin] [--wait us] <r g b>...");
        return;
      }
      int pin = resolveRgbPin(ctx);
      if (pin < 0)
      {
        return;
      }
      uint32_t waitUs = 0;
      if (!resolveWaitOption(ctx, 100, waitUs))
      {
        return;
      }

      const size_t colorCount = ctx.argc() / 3;
      uint8_t colors[64][3];
      if (colorCount > 64)
      {
        ctx.printError(413, "Too many colors");
        return;
      }
      for (size_t i = 0; i < colorCount; ++i)
      {
        if (!parseUint8Component(ctx, ctx.arg(i * 3 + 0), colors[i][0], "Invalid red") ||
            !parseUint8Component(ctx, ctx.arg(i * 3 + 1), colors[i][1], "Invalid green") ||
            !parseUint8Component(ctx, ctx.arg(i * 3 + 2), colors[i][2], "Invalid blue"))
        {
          return;
        }
      }

      for (size_t i = 0; i < colorCount; ++i)
      {
        rgbLedWrite(pin, colors[i][0], colors[i][1], colors[i][2]);
        if (waitUs > 0 && i + 1 < colorCount)
        {
          delayMicroseconds(waitUs);
        }
      }

