tanakamasayuki/ESP32SerialCtl/src/ESP32SerialCtl.h
      ctx.printOK("rgb stream");
      char line[64];
      snprintf(line, sizeof(line), "pin: %d", pin);
      ctx.printBody(line);
      snprintf(line, sizeof(line), "colors: %u wait: %lu us",
               static_cast<unsigned int>(colorCount),
               static_cast<unsigned long>(waitUs));
      ctx.printBody(line);
    }

    static const Command kCommands[];
    static const size_t kCommandCount;

    static int rgbDefaultPin_;

    Base cli_;
  };

  template <size_t MaxLineLength, size_t MaxTokens>
  const typename ESP32SerialCtl<MaxLineLength, MaxTokens>::Command
      ESP32SerialCtl<MaxLineLength, MaxTokens>::kCommands[] = {
          {"sys", "info", &ESP32SerialCtl::handleSysInfo,
           ": Show board and firmware information"},
          {"sys", "uptime", &ESP32SerialCtl::handleSysUptime,
           ": Show system uptime"},
          {"sys", "time", &ESP32SerialCtl::handleSysTime,
           ": Show local time (ISO 8601)"},
          {"sys", "mem", &ESP32SerialCtl::handleSysMem,
           ": Show heap and PSRAM usage"},
          {"sys", "reset", &ESP32SerialCtl::handleSysReset,
           ": Software reset"},
#if defined(ESP32SERIALCTL_HAS_WIRE)
          {"i2c", "scan", &ESP32SerialCtl::handleI2cScan,
           "[--bus name|index] : Scan for I2C devices"},
          {"i2c", "read", &ESP32SerialCtl::handleI2cRead,
           "[--bus name|index] <addr> <reg> [len] : Read bytes from device"},
          {"i2c", "write", &ESP32SerialCtl::handleI2cWrite,
           "[--bus name|index] <addr> <reg> <bytes...> : Write bytes to device"},
#endif
          {"gpio", "mode", &ESP32SerialCtl::handleGpioMode,
           "<pin> <in|out|pullup|pulldown|opendrain> : Set pin mode"},
          {"gpio", "read", &ESP32SerialCtl::handleGpioRead,
           "<pin> : Read GPIO input value"},
          {"gpio", "write", &ESP32SerialCtl::handleGpioWrite,
           "<pin> <0|1|on|off|low|high> : Write GPIO output"},
          {"gpio", "toggle", &ESP32SerialCtl::handleGpioToggle,
           "<pin> : Toggle output"},
          {"adc", "read", &ESP32SerialCtl::handleAdcRead,
           "<pin> [samples N] : Read ADC value (average)"},
          {"pwm", "set", &ESP32SerialCtl::handlePwmSet,
           "<pin> <freq> <duty> : Start PWM output (12-bit fixed)"},
          {"pwm", "stop", &ESP32SerialCtl::handlePwmStop,
           "<pin> : Stop PWM output"},
          {"rgb", "pin", &ESP32SerialCtl::handleRgbPin,
           "<pin> : Set default RGB output pin"},
          {"rgb", "set", &ESP32SerialCtl::handleRgbSet,
           "[--pin pin] [--count N] [--wait us] <r> <g> <b> : Set RGB LED color"},
          {"rgb", "stream", &ESP32SerialCtl::handleRgbStream,
           "[--pin pin] [--wait us] <r> <g> <b> [...] : Stream RGB colors sequentially"},
          {nullptr, "help", &ESP32SerialCtl::handleHelp,
           ": Show help for commands"},
          {nullptr, "?", &ESP32SerialCtl::handleHelp,
           ": Shortcut for help"},
  };

  template <size_t MaxLineLength, size_t MaxTokens>
  const size_t ESP32SerialCtl<MaxLineLength, MaxTokens>::kCommandCount =
      sizeof(ESP32SerialCtl<MaxLineLength, MaxTokens>::kCommands) /
      sizeof(ESP32SerialCtl<MaxLineLength, MaxTokens>::kCommands[0]);

  template <size_t MaxLineLength, size_t MaxTokens>
  int ESP32SerialCtl<MaxLineLength, MaxTokens>::rgbDefaultPin_ =
#ifdef RGB_BUILTIN
      RGB_BUILTIN;
#else
      -1;
#endif

} // namespace esp32serialctl
